// TODO: 我们有时会鼓励你在已经解出某个练习后继续尝试。
// 如果一切正常，并且你准备好开始下一个练习，请在终端中输入 `n`。
//
// 当你修改下面的任意一行时，练习文件会重新加载！
// 试着添加一个新的 `println!`，然后在终端中查看更新后的输出。

fn main() {
    println!(r#"       Welcome to...                      "#);
    println!(r#"                 _   _ _                  "#);
    println!(r#"  _ __ _   _ ___| |_| (_)_ __   __ _ ___  "#);
    println!(r#" | '__| | | / __| __| | | '_ \ / _` / __| "#);
    println!(r#" | |  | |_| \__ \ |_| | | | | | (_| \__ \ "#);
    println!(r#" |_|   \__,_|___/\__|_|_|_| |_|\__, |___/ "#);
    println!(r#"                               |___/      "#);
    println!();
    println!("本练习可以成功编译。剩余练习中会包含编译器错误或逻辑错误。");
    println!("Rustlings 的核心就是修复这些错误并完成练习。祝你好运！");
    println!();
    println!("本练习的文件是 `exercises/00_intro/intro1.rs`。去看看吧！");
    println!("当前练习的路径总会显示在进度条下方。");
    println!("你可以点击路径，在编辑器中打开练习文件。");
}
